src/test/resources/xmlFiles/RateAmount.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header/>
    <soap:Body>
        <OTA_HotelRateAmountNotifRQ Version="1" EchoToken="1019173874" TimeStamp="2020-08-18T12:52:20.0Z" xmlns:schemalocation="http://www.opentravel.org/OTA/2003/05 OTA_HotelRateAmountNotifRQ.xsd" xmlns="http://www.opentravel.org/OTA/2003/05">
            <UniqueID ID="1590555868" Type="16"/>
            <RateAmountMessages ChainCode="UI" HotelCode="qtest1">
                <RateAmountMessage>
                    <StatusApplicationControl InvTypeCode="SRK" IsRoom="1" RatePlanCode="FRP2"/>
                    <Rates>
                        <Rate Start="2022-01-05" End="2022-01-07" CurrencyCode="USD" RateTimeUnit="Day" UnitMultiplier="1" Mon="1" Tue="1" Weds="1" Thur="1" Fri="1" Sat="1" Sun="1">
                            <BaseByGuestAmts>
                                <BaseByGuestAmt AmountAfterTax="30.00" CurrencyCode="USD" NumberOfGuests="2"/>
                            </BaseByGuestAmts>
                        </Rate>
                    </Rates>
                </RateAmountMessage>
            </RateAmountMessages>
        </OTA_HotelRateAmountNotifRQ>
    </soap:Body>
</soap:Envelope>