project/test_automation/bw-exp/Expedia-BW-Booking/bak/TC01.031/HttpRQ1-EXPcancelReservation.xml

<?xml version="1.0" encoding="utf-8"?>

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
	<soap-env:Header>
		<Interface xmlns="http://www.newtrade.com/expedia/R14/header" Name="ExpediaDirectConnect" Version="4.0">
			<PayloadInfo ExpirationDateTime="2018-05-01T21:41:00-07:00" Location="Body" RequestId="REQ01031" RequestorId="Expedia.com" ResponderId="BW_DerbySoft">
				<CommDescriptor DestinationId="BW_DerbySoft" RetryIndicator="false" SourceId="ExpediaDC">
					<Authentication Password="x2zlfSYB" Username="Expedia"/>
				</CommDescriptor>
				<PayloadDescriptor Name="OTA_CancelRQ" Version="2003A">
					<PayloadReference DistributorHotelId="19010" SupplierBrandCode="BW" SupplierChainCode="BW" SupplierHotelCode="19010"/>
				</PayloadDescriptor>
			</PayloadInfo>
		</Interface>
	</soap-env:Header>
	<soap-env:Body>
		<OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Commit" EchoToken="REQ01031" PrimaryLangID="en-us" Target="Production" TimeStamp="2018-05-01T19:11:00-07:00" Version="1.000">
			<POS>
				<Source>
					<RequestorID ID="A-Hotels.com" Type="18"/>
					<BookingChannel Primary="true" Type="2">
						<CompanyName>Expedia</CompanyName>
					</BookingChannel>
				</Source>
				<Source>
					<RequestorID ID="96076315" Type="5"/>
				</Source>
			</POS>
			<UniqueID ID="CHN01031" Type="14">
				<CompanyName>Expedia</CompanyName>
			</UniqueID>
			<UniqueID ID="HTL01031" Type="10">
				<CompanyName>BW_DerbySoft</CompanyName>
			</UniqueID>
			<Verification>
				<PersonName>
					<GivenName>Brenda</GivenName>
					<Surname>Nystrom</Surname>
				</PersonName>
				<Vendor Code="1" CodeContext="ChainCode">BW</Vendor>
				<Vendor Code="2" CodeContext="BrandCode">BW</Vendor>
				<Vendor Code="3" CodeContext="HotelCode">19010</Vendor>
				<ReservationTimeSpan End="2018-05-03" Start="2018-05-02"/>
				<AssociatedQuantity Code="1" CodeContext="Number of rooms" Quantity="1"/>
				<AssociatedQuantity Code="2" CodeContext="Number of guests" Quantity="2"/>
			</Verification>
		</OTA_CancelRQ>
	</soap-env:Body>
</soap-env:Envelope>