project/report/20180607/171439_bw-exp/cache/3.060000.txt

['<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><OTA_CancelRQ xmlns="http://www.opentravel.org/OTA/2003/05" CancelType="Cancel" EchoToken="e0ad5a61-8bb4-47c7-adcf-c4a7a8dca1a6" PrimaryLangID="en_US" Target="Test" TimeStamp="2018-06-07T09:18:30.002Z" TransactionIdentifier="93727FF0AF38416E83800068A48E1136" Version="5.000"><UniqueID ID="BW" Instance="CHN" Type="10"/><UniqueID ID="HTL01031" Instance="CNF" Type="14"/><UniqueID ID="CHN01031" Instance="PNR" Type="14"/></OTA_CancelRQ></SOAP-ENV:Body></SOAP-ENV:Envelope>']