atibd/certification/CancelRQ_fees.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.opentravel.org/OTA/2003/05">
<soap:Header/>
<soap:Body>
    <ns1:OTA_CancelRQ Version="1.3">
        <ns1:UniqueID ID="6066750"/>
    </ns1:OTA_CancelRQ>
</soap:Body>
</soap:Envelope>